AlmAck/nuttx/arch/arm/src/da1470x/da1470x_lcdc.c
/****************************************************************************
 * arch/arm/src/da1470x/da1470x_lcdc.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Framebuffer driver for the DA1470x display controller driving a panel
 * over the DBI block in quad-SPI mode.  The LCDC fetches Layer 0 from the
 * frame buffer by DMA.  Each update sets the panel window to the dirty
 * rectangle, points the layer at that rectangle inside the frame buffer,
 * sends the RAMWR command bound to the pixel stream as one chip-select
 * burst and waits for FRAME_END.  The frame buffer holds one or two
 * screens (CONFIG_DA1470X_LCDC_NBUFFERS); a client selects the second
 * one by updating rows at yres..2*yres-1 and panning to it.
 */

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/kthread.h>
#include <nuttx/power/pm.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/wqueue.h>
#include <nuttx/video/fb.h>

#include "arm_internal.h"
#include "hardware/da1470x_crg_sys.h"
#include "hardware/da1470x_crg_top.h"
#include "hardware/da1470x_lcdc.h"
#include "da1470x_lcdc.h"
#include "da1470x_pmu.h"
#include "da1470x_clockconfig.h"

#ifdef CONFIG_DA1470X_LCDC

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define LCDC_FIFO_WAIT_LOOPS    100000
#define LCDC_FRAME_TIMEOUT_MS   500
#define LCDC_TE_TIMEOUT_MS      50

#ifndef CONFIG_DA1470X_LCDC_NBUFFERS
#  define CONFIG_DA1470X_LCDC_NBUFFERS 1
#endif

#define LCDC_NBUFFERS           CONFIG_DA1470X_LCDC_NBUFFERS

#ifdef CONFIG_DA1470X_LCDC_ASYNC
#  define LCDC_THREAD_PRIORITY  CONFIG_DA1470X_LCDC_ASYNC_PRIORITY
#  define LCDC_THREAD_STACKSIZE 2048
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct da1470x_lcdc_s
{
  struct fb_vtable_s vtable;                  /* Framebuffer interface */
  const struct da1470x_lcdc_panel_s *panel;   /* Attached panel */
  uint8_t *fbmem;                             /* Frame buffers */
  size_t   fblen;                             /* Size of all buffers */
  size_t   buflen;                            /* Size of one buffer */
  uint16_t stride;                            /* Bytes per line */
  mutex_t  lock;                              /* Serialises updates */
  sem_t    frame;                             /* FRAME_END / TE wake-up */
  struct work_s panwork;                      /* Releases pan requests */
  struct fb_area_s pending;                   /* Last area sent */
  int      lastbuf;                           /* Buffer it was sent from */
  int      shown;                             /* Buffer the panel shows */
#ifdef CONFIG_DA1470X_LCDC_ASYNC
  sem_t    request;                           /* Wakes the transfer thread */
  sem_t    idle;                              /* No transfer in flight */
  struct fb_area_s req;                       /* Queued transfer: area */
  int      reqbuf;                            /* Queued transfer: buffer */
#endif
  bool     initialized;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int lcdc_getvideoinfo(struct fb_vtable_s *vtable,
                             struct fb_videoinfo_s *vinfo);
static int lcdc_getplaneinfo(struct fb_vtable_s *vtable, int planeno,
                             struct fb_planeinfo_s *pinfo);
static int lcdc_updatearea(struct fb_vtable_s *vtable,
                           const struct fb_area_s *area);
static int lcdc_pandisplay(struct fb_vtable_s *vtable,
                           struct fb_planeinfo_s *pinfo);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct da1470x_lcdc_s g_lcdc =
{
  .vtable =
  {
    .getvideoinfo = lcdc_getvideoinfo,
    .getplaneinfo = lcdc_getplaneinfo,
    .updatearea   = lcdc_updatearea,
    .pandisplay   = lcdc_pandisplay,
  },
  .lock  = NXMUTEX_INITIALIZER,
  .frame = SEM_INITIALIZER(0),
#ifdef CONFIG_DA1470X_LCDC_ASYNC
  .request = SEM_INITIALIZER(0),
  .idle    = SEM_INITIALIZER(1),
#endif
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: lcdc_fifo_push
 *
 * Description:
 *   Push one entry into the DBI command FIFO, waiting for room.
 *
 ****************************************************************************/

