AlmAck/nuttx/arch/arm/src/da1470x/da1470x_lcdc.c
static int lcdc_fifo_push(uint32_t value)
{
  int i;

  for (i = 0; i < LCDC_FIFO_WAIT_LOOPS; i++)
    {
      if ((getreg32(DA1470X_LCDC_STATUS) &
           LCDC_STATUS_DBIB_CMD_FIFO_FULL) == 0)
        {
          putreg32(value, DA1470X_LCDC_DBIB_CMD);
          return OK;
        }
    }

  lcderr("DBI command FIFO stuck full\n");
  return -ETIMEDOUT;
}

/****************************************************************************
 * Name: lcdc_clock_select
 *
 * Description:
 *   Feed the controller from whichever of the fixed 32 MHz peripheral
 *   clock and the system clock gives the highest serial clock that stays
 *   within the panel's limit, and program the divider accordingly.
 *
 ****************************************************************************/

static void lcdc_clock_select(const struct da1470x_lcdc_panel_s *panel)
{
  uint32_t limit = panel->sclk_max ? panel->sclk_max : 32000000;
  uint32_t divn  = da1470x_get_divn_clk();
  uint32_t sys   = da1470x_get_sysclk();
  uint32_t divn_div;
  uint32_t sys_div;
  uint32_t div;
  bool use_sys;

  divn_div = (divn + limit - 1) / limit;
  sys_div  = (sys + limit - 1) / limit;
  if (divn_div == 0)
    {
      divn_div = 1;
    }

  if (sys_div == 0)
    {
      sys_div = 1;
    }

  use_sys = (sys / sys_div) > (divn / divn_div);
  div     = use_sys ? sys_div : divn_div;

  if (use_sys)
    {
      putreg32(CRG_SYS_CLK_SYS_LCD_CLK_SEL, DA1470X_CRG_SYS_SET_CLK_SYS);
    }
  else
    {
      putreg32(CRG_SYS_CLK_SYS_LCD_CLK_SEL, DA1470X_CRG_SYS_RESET_CLK_SYS);
    }

  modifyreg32(DA1470X_LCDC_CLKCTRL, LCDC_CLKCTRL_CLK_DIV_MASK,
              LCDC_CLKCTRL_CLK_DIV(div));

  lcdinfo("Serial clock %lu Hz from %s\n",
          (unsigned long)((use_sys ? sys : divn) / div),
          use_sys ? "the system clock" : "DIVN");
}

/****************************************************************************
 * Name: lcdc_qspi_configure
 *
 * Description:
 *   Configure the DBI block for a quad-SPI panel: 4-wire command phase,
 *   quad data phase, SPI mode 0, and the interface clock divider.
 *
 ****************************************************************************/

static void lcdc_qspi_configure(const struct da1470x_lcdc_panel_s *panel)
{
  uint32_t cfg;

  /* Output colour format on the serial interface: 8-bit RGB888 or the
   * two-byte RGB565 packing, matching the panel's COLMOD setting.  TE
   * detection stays disabled until a frame waits for it.
   */

  cfg = LCDC_DBIB_CFG_DBIB_INTERFACE_EN |
        LCDC_DBIB_CFG_DBIB_RESX_OUT_EN |
        LCDC_DBIB_CFG_SPI4_EN |
        LCDC_DBIB_CFG_QUAD_SPI_EN |
        LCDC_DBIB_CFG_SPI_DC_AS_SPI_SD1 |
        LCDC_DBIB_CFG_INTERFACE_WIDTH_QSPI |
        LCDC_DBIB_CFG_DBIB_TE_DISABLE |
        LCDC_DBIB_CFG_DBIB_COLOR_FMT(panel->bpp == 32 ?
                                     LCDC_OCM_8RGB888 : LCDC_OCM_8RGB565);

  putreg32(cfg, DA1470X_LCDC_DBIB_CFG);

  /* One-shot frames only; guard against FIFO underrun */

  putreg32(LCDC_MODE_UNDERRUN_PREVENTION_EN, DA1470X_LCDC_MODE);

  lcdc_clock_select(panel);

  /* Route the serial interface to the pads and let the LCDC drive them.
   * The panel's tearing-effect line is active high.
   */

  modifyreg32(DA1470X_LCDC_GPIO, LCDC_GPIO_GPIO_OUTPUT_MODE_MASK,
              LCDC_GPIO_OUTPUT_MODE_SPI | LCDC_GPIO_GPIO_OUTPUT_EN |
              LCDC_GPIO_GPIO_SPI_SI_ON_SD_PAD | LCDC_GPIO_TE_INV);
}

/****************************************************************************
 * Name: lcdc_jdi_configure
 *
 * Description:
 *   JDI memory-in-pixel parallel interface: the controller generates
 *   XRST, VST, VCK, HST, HCK and ENB itself and shifts two bits per
 *   colour on six data lines, two rows per VCK (double scan).  The
 *   pulse widths and offsets are derived from the line length the way
 *   the vendor driver does; the horizontal values count HCK quarters,
 *   the vertical ones VCK halves.  There are no commands: a frame is
 *   whole-screen, and the panel keeps it.
 *
 ****************************************************************************/

static void lcdc_jdi_configure(const struct da1470x_lcdc_panel_s *panel)
{
  const struct da1470x_lcdc_jdi_s *jdi = &panel->jdi;
  uint32_t line;
  uint32_t hck_width;
  uint32_t vck_width;
  uint32_t xrst_width;
  uint32_t regval;

  putreg32(LCDC_DBIB_CFG_DBIB_RESX_OUT_EN |
           LCDC_DBIB_CFG_DBIB_TE_DISABLE |
           LCDC_DBIB_CFG_DBIB_COLOR_FMT(LCDC_OCM_RGB222),
           DA1470X_LCDC_DBIB_CFG);

  putreg32(LCDC_MODE_OUT_MODE_JDIMIP | LCDC_MODE_DSCAN |
           LCDC_MODE_UNDERRUN_PREVENTION_EN, DA1470X_LCDC_MODE);

  line       = (panel->xres + jdi->fpx + jdi->blx + jdi->bpx) / 2;
  hck_width  = 2;
  vck_width  = line * hck_width;
  xrst_width = panel->yres * 2 + jdi->fpy + jdi->bly + jdi->bpy - 2;

  regval = LCDC_FMTCTRL_JDIP_HST_WIDTH(hck_width) |
           LCDC_FMTCTRL_JDIP_HST_OFFSET(hck_width) |
           LCDC_FMTCTRL_JDIP_VST_WIDTH(vck_width) |
           LCDC_FMTCTRL_JDIP_VST_OFFSET(vck_width / 2 + 2);
  putreg32(regval, DA1470X_LCDC_FMTCTRL);

  regval = LCDC_FMTCTRL_2_JDIP_ENB_WIDTH(vck_width / 2) |
           LCDC_FMTCTRL_2_JDIP_ENB_OFFSET(vck_width / 4 + 3) |
           LCDC_FMTCTRL_2_JDIP_XRST_OFFSET(vck_width / 4 + 2);
  putreg32(regval, DA1470X_LCDC_FMTCTRL_2);

  putreg32(LCDC_FMTCTRL_3_XRST_HIGH_STATE(xrst_width),
           DA1470X_LCDC_FMTCTRL_3);

  lcdc_clock_select(panel);

  modifyreg32(DA1470X_LCDC_GPIO, LCDC_GPIO_GPIO_OUTPUT_MODE_MASK |
              LCDC_GPIO_GPIO_SPI_SI_ON_SD_PAD | LCDC_GPIO_TE_INV,
              LCDC_GPIO_OUTPUT_MODE_JDI | LCDC_GPIO_GPIO_OUTPUT_EN);

  /* VCOM/FRP: a square wave from the 32 kHz sleep clock divided by
   * 32 * (reload + 1), kept running by CRG_TOP so it survives sleep.
   */

  if (panel->ext_clk_dhz != 0)
    {
      uint32_t reload = (32000 * 10) / ((uint32_t)panel->ext_clk_dhz * 32);

      if (reload > 0)
        {
          reload--;
        }

      if (reload > (CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD_MASK >>
                    CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD_SHIFT))
        {
          reload = CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD_MASK >>
                   CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD_SHIFT;
        }

      putreg32(CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CLK_EN |
               CRG_TOP_LCD_EXT_CTRL_LCD_EXT_CNT_RELOAD(reload),
               DA1470X_CRG_TOP_LCD_EXT_CTRL);
    }
}

/****************************************************************************
 * Name: lcdc_set_timing
 *
 * Description:
 *   Program the resolution of the next transfer and the porch/blanking
 *   values: the minimal ones for serial panels (fpx=1, blx=2, bpx=1,
 *   fpy=1, bly=1, bpy=1), the panel's own for JDI parallel.
 *
 ****************************************************************************/

static void lcdc_set_timing(const struct da1470x_lcdc_panel_s *panel,
                            uint16_t resx, uint16_t resy)
{
  uint16_t fpx;
  uint16_t blx;
  uint16_t bpx;
  uint16_t fpy;
  uint16_t bly;
  uint16_t bpy;

  if (panel->iface == DA1470X_LCDC_IF_JDI_PARALLEL)
    {
      /* Two rows per VCK, and the panel's own porches */

      resy *= 2;
      fpx = resx + panel->jdi.fpx;
      blx = fpx + panel->jdi.blx;
      bpx = blx + panel->jdi.bpx;
      fpy = resy + panel->jdi.fpy;
      bly = fpy + panel->jdi.bly;
      bpy = bly + panel->jdi.bpy;
    }
  else
    {
      fpx = resx + 1;
      blx = fpx + 2;
      bpx = blx + 1;
      fpy = resy + 1;
      bly = fpy + 1;
      bpy = bly + 1;
    }

  putreg32(LCDC_XY_PACK(resx, resy),   DA1470X_LCDC_RESXY);
  putreg32(LCDC_XY_PACK(fpx, fpy),     DA1470X_LCDC_FRONTPORCHXY);
  putreg32(LCDC_XY_PACK(blx, bly),     DA1470X_LCDC_BLANKINGXY);
  putreg32(LCDC_XY_PACK(bpx, bpy),     DA1470X_LCDC_BACKPORCHXY);
  putreg32(LCDC_XY_PACK(fpx, fpy - 1), DA1470X_LCDC_STARTXY);
}

/****************************************************************************
 * Name: lcdc_set_layer0
 *
 * Description:
 *   Point Layer 0 at a rectangle of one frame buffer.  The layer keeps
 *   the full line stride so any window of the buffer can be sent.
 *
 ****************************************************************************/

static void lcdc_set_layer0(struct da1470x_lcdc_s *priv, uint8_t *base,
                            uint16_t w, uint16_t h)
{
  const struct da1470x_lcdc_panel_s *panel = priv->panel;
  uint32_t mode;

  uint32_t cm;

  if (panel->iface == DA1470X_LCDC_IF_JDI_PARALLEL)
    {
      h *= 2;                       /* Double scan */
    }

  putreg32((uint32_t)(uintptr_t)base, DA1470X_LCDC_LAYER0_BASEADDR);
  putreg32(LCDC_XY_PACK(0, 0), DA1470X_LCDC_LAYER0_STARTXY);
  putreg32(LCDC_XY_PACK(w, h), DA1470X_LCDC_LAYER0_SIZEXY);
  putreg32(LCDC_XY_PACK(w, h), DA1470X_LCDC_LAYER0_RESXY);
  putreg32(priv->stride, DA1470X_LCDC_LAYER0_STRIDE);

  /* Opaque copy: source factor one, destination factor zero */

