AlmAck/nuttx/arch/arm/src/da1470x/da1470x_lcdc.c
  cm = panel->bpp == 32 ? LCDC_LCM_RGBA8888 :
       panel->bpp == 16 ? LCDC_LCM_RGB565 : LCDC_LCM_RGB332;

  mode = LCDC_LAYER0_MODE_L0_EN | LCDC_LAYER0_MODE_L0_ALPHA(0xff) |
         LCDC_LAYER0_MODE_L0_SRC_BLEND(LCDC_BF_ONE) |
         LCDC_LAYER0_MODE_L0_DST_BLEND(LCDC_BF_ZERO) |
         LCDC_LAYER0_MODE_L0_COLOR_MODE(cm);
  putreg32(mode, DA1470X_LCDC_LAYER0_MODE);
}

/****************************************************************************
 * Name: lcdc_interrupt
 *
 * Description:
 *   Either the tearing-effect edge the updater armed, or FRAME_END.  On
 *   FRAME_END release the command/data binding and the forced chip
 *   select so the panel does not latch subsequent traffic as pixels.
 *   In both cases wake the updater.
 *
 ****************************************************************************/

static int lcdc_interrupt(int irq, void *context, void *arg)
{
  struct da1470x_lcdc_s *priv = (struct da1470x_lcdc_s *)arg;
  uint32_t enabled = getreg32(DA1470X_LCDC_INTERRUPT);

  if ((enabled & LCDC_INTERRUPT_TE_IRQ_EN) != 0)
    {
      modifyreg32(DA1470X_LCDC_INTERRUPT, LCDC_INTERRUPT_TE_IRQ_EN, 0);
    }
  else
    {
      modifyreg32(DA1470X_LCDC_INTERRUPT, LCDC_INTERRUPT_FE_IRQ_EN, 0);
      modifyreg32(DA1470X_LCDC_DBIB_CFG,
                  LCDC_DBIB_CFG_CMD_DATA_AS_HEADER |
                  LCDC_DBIB_CFG_DBIB_CSX_CFG_EN, 0);
    }

  nxsem_post(&priv->frame);
  return OK;
}

/****************************************************************************
 * Name: lcdc_wait_te
 *
 * Description:
 *   Enable tearing-effect detection, wait for the next edge, disable it
 *   again.  A missing edge only costs the timeout.
 *
 ****************************************************************************/

#ifdef CONFIG_DA1470X_LCDC_TE
static void lcdc_wait_te(struct da1470x_lcdc_s *priv)
{
  int ret;

  modifyreg32(DA1470X_LCDC_DBIB_CFG, LCDC_DBIB_CFG_DBIB_TE_DISABLE, 0);
  modifyreg32(DA1470X_LCDC_INTERRUPT, 0, LCDC_INTERRUPT_TE_IRQ_EN);

  ret = nxsem_tickwait_uninterruptible(&priv->frame,
                                       MSEC2TICK(LCDC_TE_TIMEOUT_MS));
  if (ret < 0)
    {
      lcdwarn("No tearing-effect edge\n");
      modifyreg32(DA1470X_LCDC_INTERRUPT, LCDC_INTERRUPT_TE_IRQ_EN, 0);
    }

  modifyreg32(DA1470X_LCDC_DBIB_CFG, 0, LCDC_DBIB_CFG_DBIB_TE_DISABLE);
}
#endif

/****************************************************************************
 * Name: lcdc_send_region
 *
 * Description:
 *   Transfer the rectangle (x, y, w, h) of frame buffer 'buf' to the same
 *   position of the panel: set the panel window, size the transfer and
 *   the layer, queue the RAMWR command bound to the pixel stream with
 *   chip select held low, trigger a single frame and wait for it.
 *
 ****************************************************************************/

static int lcdc_send_region(struct da1470x_lcdc_s *priv, int buf,
                            uint16_t x, uint16_t y, uint16_t w, uint16_t h)
{
  const struct da1470x_lcdc_panel_s *panel = priv->panel;
  uint8_t *base;
  uint32_t cfg;
  int ret;

  if (panel->window != NULL)
    {
      panel->window(panel, x, y, x + w - 1, y + h - 1);
    }

  base = priv->fbmem + (size_t)buf * priv->buflen +
         (size_t)y * priv->stride + (size_t)x * (panel->bpp / 8);

  lcdc_set_timing(panel, w, h);
  lcdc_set_layer0(priv, base, w, h);

  if (panel->iface == DA1470X_LCDC_IF_JDI_PARALLEL)
    {
      /* No command header, no chip select: fire the frame */

#ifdef CONFIG_PM
      pm_stay(PM_IDLE_DOMAIN, PM_NORMAL);
#endif
      modifyreg32(DA1470X_LCDC_INTERRUPT, 0, LCDC_INTERRUPT_FE_IRQ_EN);
      modifyreg32(DA1470X_LCDC_MODE, 0, LCDC_MODE_SFRAME_UPD);
      ret = nxsem_tickwait_uninterruptible(&priv->frame,
                                           MSEC2TICK(LCDC_FRAME_TIMEOUT_MS));
#ifdef CONFIG_PM
      pm_relax(PM_IDLE_DOMAIN, PM_NORMAL);
#endif
      if (ret < 0)
        {
          lcderr("Frame timed out (status %08" PRIx32 ")\n",
                 getreg32(DA1470X_LCDC_STATUS));
          modifyreg32(DA1470X_LCDC_INTERRUPT, LCDC_INTERRUPT_FE_IRQ_EN, 0);
        }

      return ret;
    }

#ifdef CONFIG_DA1470X_LCDC_TE
  if (panel->te)
    {
      lcdc_wait_te(priv);
    }
#endif

  /* Hold the write-memory command so it goes out as the header of the
   * pixel burst, in one chip-select transaction.
   */

  da1470x_lcdc_dcs_hold(true);

  lcdc_fifo_push(LCDC_DBIB_CMD_DBIB_CMD_SEND |
                 LCDC_DBIB_CMD_QSPI_SERIAL_CMD_TRANS |
                 panel->frame_prefix);
  lcdc_fifo_push(LCDC_DBIB_CMD_DBIB_CMD_SEND |
                 LCDC_DBIB_CMD_QSPI_SERIAL_CMD_TRANS |
                 LCDC_DBIB_CMD_CMD_WIDTH_24 |
                 ((uint32_t)panel->ramwr << 8));

  /* Chip select forced low for the whole frame */

  cfg  = getreg32(DA1470X_LCDC_DBIB_CFG);
  cfg |= LCDC_DBIB_CFG_DBIB_CSX_CFG_EN;
  cfg &= ~LCDC_DBIB_CFG_DBIB_CSX_CFG;
  putreg32(cfg, DA1470X_LCDC_DBIB_CFG);

  /* Arm FRAME_END and fire the frame.  The system clock, and with it
   * the serial clock, must not change while the frame is on the wire.
   */

#ifdef CONFIG_PM
  pm_stay(PM_IDLE_DOMAIN, PM_NORMAL);
#endif

  modifyreg32(DA1470X_LCDC_INTERRUPT, 0, LCDC_INTERRUPT_FE_IRQ_EN);
  modifyreg32(DA1470X_LCDC_MODE, 0, LCDC_MODE_SFRAME_UPD);

  ret = nxsem_tickwait_uninterruptible(&priv->frame,
                                       MSEC2TICK(LCDC_FRAME_TIMEOUT_MS));

#ifdef CONFIG_PM
  pm_relax(PM_IDLE_DOMAIN, PM_NORMAL);
#endif
  if (ret < 0)
    {
      lcderr("Frame timed out (status %08" PRIx32 ")\n",
             getreg32(DA1470X_LCDC_STATUS));

      /* Recover the interface as the interrupt would have */

      modifyreg32(DA1470X_LCDC_INTERRUPT, LCDC_INTERRUPT_FE_IRQ_EN, 0);
      modifyreg32(DA1470X_LCDC_DBIB_CFG,
                  LCDC_DBIB_CFG_CMD_DATA_AS_HEADER |
                  LCDC_DBIB_CFG_DBIB_CSX_CFG_EN, 0);
    }

  return ret;
}

/****************************************************************************
 * Name: lcdc_thread
 *
 * Description:
 *   Sends the queued transfer and reports the controller idle again.
 *   With two frame buffers the client that alternates between them can
 *   draw its next frame while this thread waits for the tearing-effect
 *   edge and for the end of the frame.
 *
 ****************************************************************************/

#ifdef CONFIG_DA1470X_LCDC_ASYNC
static int lcdc_thread(int argc, char *argv[])
{
  struct da1470x_lcdc_s *priv = &g_lcdc;
  int ret;

