AlmAck/nuttx/arch/arm/src/da1470x/da1470x_lcdc.c
  for (; ; )
    {
      ret = nxsem_wait_uninterruptible(&priv->request);
      if (ret < 0)
        {
          continue;
        }

      ret = lcdc_send_region(priv, priv->reqbuf, priv->req.x, priv->req.y,
                             priv->req.w, priv->req.h);
      if (ret < 0)
        {
          lcderr("Queued transfer failed: %d\n", ret);
        }

      nxsem_post(&priv->idle);
    }

  return 0;
}
#endif

/****************************************************************************
 * Name: lcdc_transfer
 *
 * Description:
 *   Wait for the transfer in flight, if any, then send a region either
 *   from the driver thread (returning at once) or from the caller.  The
 *   lock must be held.
 *
 ****************************************************************************/

static int lcdc_transfer(struct da1470x_lcdc_s *priv, int buf, uint16_t x,
                         uint16_t y, uint16_t w, uint16_t h, bool async)
{
#ifdef CONFIG_DA1470X_LCDC_ASYNC
  int ret;

  ret = nxsem_wait_uninterruptible(&priv->idle);
  if (ret < 0)
    {
      return ret;
    }

  if (async)
    {
      priv->reqbuf = buf;
      priv->req.x  = x;
      priv->req.y  = y;
      priv->req.w  = w;
      priv->req.h  = h;
      nxsem_post(&priv->request);
      return OK;
    }

  ret = lcdc_send_region(priv, buf, x, y, w, h);
  nxsem_post(&priv->idle);
  return ret;
#else
  UNUSED(async);
  return lcdc_send_region(priv, buf, x, y, w, h);
#endif
}

/****************************************************************************
 * Name: lcdc_panwork
 *
 * Description:
 *   Every update is transferred synchronously, so a pan request queued by
 *   the upper half is complete as soon as it is recorded.  Release the
 *   queue from the work queue, after the ioctl that queued it returned.
 *
 ****************************************************************************/

static void lcdc_panwork(void *arg)
{
  struct da1470x_lcdc_s *priv = (struct da1470x_lcdc_s *)arg;

  while (fb_remove_paninfo(&priv->vtable, FB_NO_OVERLAY) == OK);
}

/****************************************************************************
 * Name: lcdc_getvideoinfo
 ****************************************************************************/

static int lcdc_getvideoinfo(struct fb_vtable_s *vtable,
                             struct fb_videoinfo_s *vinfo)
{
  struct da1470x_lcdc_s *priv = (struct da1470x_lcdc_s *)vtable;

  if (vinfo == NULL || !priv->initialized)
    {
      return -EINVAL;
    }

  memset(vinfo, 0, sizeof(*vinfo));
  vinfo->fmt     = priv->panel->bpp == 32 ? FB_FMT_RGBA32 :
                   priv->panel->bpp == 16 ? FB_FMT_RGB16_565 :
                   FB_FMT_RGB8_332;
  vinfo->xres    = priv->panel->xres;
  vinfo->yres    = priv->panel->yres;
  vinfo->nplanes = 1;
  return OK;
}

/****************************************************************************
 * Name: lcdc_getplaneinfo
 ****************************************************************************/

static int lcdc_getplaneinfo(struct fb_vtable_s *vtable, int planeno,
                             struct fb_planeinfo_s *pinfo)
{
  struct da1470x_lcdc_s *priv = (struct da1470x_lcdc_s *)vtable;

  if (pinfo == NULL || planeno != 0 || !priv->initialized)
    {
      return -EINVAL;
    }

  memset(pinfo, 0, sizeof(*pinfo));
  pinfo->fbmem        = priv->fbmem;
  pinfo->fblen        = priv->fblen;
  pinfo->stride       = priv->stride;
  pinfo->display      = 0;
  pinfo->bpp          = priv->panel->bpp;
  pinfo->xres_virtual = priv->panel->xres;
  pinfo->yres_virtual = priv->panel->yres * LCDC_NBUFFERS;
  return OK;
}

/****************************************************************************
 * Name: lcdc_updatearea
 *
 * Description:
 *   Send the dirty rectangle.  Rows beyond the visible height address
 *   the second buffer.  The RM69091-class controllers need the window
 *   to start on even coordinates with even sizes, so the rectangle is
 *   widened to satisfy that and clamped to the panel.
 *
 ****************************************************************************/

static int lcdc_updatearea(struct fb_vtable_s *vtable,
                           const struct fb_area_s *area)
{
  struct da1470x_lcdc_s *priv = (struct da1470x_lcdc_s *)vtable;
  const struct da1470x_lcdc_panel_s *panel = priv->panel;
  uint16_t x0;
  uint16_t y0;
  uint16_t x1;
  uint16_t y1;
  int buf;
  int ret;

  if (!priv->initialized)
    {
      return -ENODEV;
    }

  /* The row range names the buffer: rows beyond the visible height are
   * the second buffer.  Clients that pan (LVGL, the fb example) always
   * update with the offset of the buffer they drew into, so the area is
   * taken from that buffer and the pan that follows does not send it
   * again.
   */

  buf = area->y / panel->yres;
  if (buf >= LCDC_NBUFFERS)
    {
      return -EINVAL;
    }

  x0 = area->x;
  y0 = area->y % panel->yres;
  x1 = x0 + area->w;
  y1 = y0 + area->h;

  if (panel->iface == DA1470X_LCDC_IF_JDI_PARALLEL)
    {
      /* The parallel interface addresses no window: whole frames only */

      x0 = 0;
      y0 = 0;
      x1 = panel->xres;
      y1 = panel->yres;
    }

  x0 &= ~1;
  y0 &= ~1;
  x1  = (x1 + 1) & ~1;
  y1  = (y1 + 1) & ~1;

  if (x1 > panel->xres)
    {
      x1 = panel->xres;
    }

  if (y1 > panel->yres)
    {
      y1 = panel->yres;
    }

  if (x0 >= x1 || y0 >= y1)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* A client that hands over another buffer than last time is double
   * buffering: it will not touch this one until the next swap, so the
   * frame can go out while it draws.  Anybody else may redraw the same
   * buffer as soon as this returns and gets a finished transfer.
   */

  ret = lcdc_transfer(priv, buf, x0, y0, x1 - x0, y1 - y0,
                      buf != priv->lastbuf);

  priv->pending.x = x0;
  priv->pending.y = y0;
  priv->pending.w = x1 - x0;
  priv->pending.h = y1 - y0;
  priv->lastbuf   = buf;

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: lcdc_pandisplay
 *
 * Description:
 *   The client selects the buffer to show through yoffset.  The content
 *   has already been transferred by the preceding update, so nothing is
 *   sent here; the pan queue entry is released from the work queue.
 *
 ****************************************************************************/

static int lcdc_pandisplay(struct fb_vtable_s *vtable,
                           struct fb_planeinfo_s *pinfo)
{
  struct da1470x_lcdc_s *priv = (struct da1470x_lcdc_s *)vtable;
  int buf;
  int ret;

