AlmAck/nuttx/arch/arm/src/da1470x/da1470x_lcdc.c
  if (!priv->initialized || pinfo == NULL ||
      pinfo->yoffset >= priv->panel->yres * LCDC_NBUFFERS)
    {
      return -EINVAL;
    }

  buf = pinfo->yoffset / priv->panel->yres;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  /* The last update was taken from another buffer than the one now
   * selected: the client drew into the new buffer before panning, so
   * transfer the same area from it.
   */

  if (buf != priv->lastbuf && priv->pending.w != 0)
    {
      lcdc_transfer(priv, buf, priv->pending.x, priv->pending.y,
                    priv->pending.w, priv->pending.h, false);
      priv->lastbuf = buf;
    }

  priv->shown = buf;
  nxmutex_unlock(&priv->lock);

  if (work_available(&priv->panwork))
    {
      work_queue(LPWORK, &priv->panwork, lcdc_panwork, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: da1470x_lcdc_dcs_cmd
 ****************************************************************************/

void da1470x_lcdc_dcs_cmd(uint8_t cmd)
{
  uint8_t prefix = g_lcdc.panel ? g_lcdc.panel->cmd_prefix : 0x02;

  /* Prefix byte opens a new transaction; the DCS command follows in a
   * 24-bit field with the command at bits 15:8.
   */

  lcdc_fifo_push(LCDC_DBIB_CMD_DBIB_CMD_SEND |
                 LCDC_DBIB_CMD_QSPI_SERIAL_CMD_TRANS | prefix);
  lcdc_fifo_push(LCDC_DBIB_CMD_DBIB_CMD_SEND |
                 LCDC_DBIB_CMD_QSPI_SERIAL_CMD_TRANS |
                 LCDC_DBIB_CMD_CMD_WIDTH_24 | ((uint32_t)cmd << 8));
}

/****************************************************************************
 * Name: da1470x_lcdc_dcs_data
 ****************************************************************************/

void da1470x_lcdc_dcs_data(uint8_t data)
{
  lcdc_fifo_push(LCDC_DBIB_CMD_QSPI_SERIAL_CMD_TRANS | data);
}

/****************************************************************************
 * Name: da1470x_lcdc_dcs_hold
 ****************************************************************************/

void da1470x_lcdc_dcs_hold(bool hold)
{
  int i;

  /* The configuration register must not change while the command FIFO
   * is being drained.
   */

  for (i = 0; i < LCDC_FIFO_WAIT_LOOPS; i++)
    {
      if ((getreg32(DA1470X_LCDC_STATUS) &
           LCDC_STATUS_DBIB_CMD_PENDING) == 0)
        {
          break;
        }
    }

  if (hold)
    {
      modifyreg32(DA1470X_LCDC_DBIB_CFG, 0,
                  LCDC_DBIB_CFG_CMD_DATA_AS_HEADER);
    }
  else
    {
      modifyreg32(DA1470X_LCDC_DBIB_CFG,
                  LCDC_DBIB_CFG_CMD_DATA_AS_HEADER, 0);
    }
}

/****************************************************************************
 * Name: da1470x_lcdc_register
 ****************************************************************************/

int da1470x_lcdc_register(const struct da1470x_lcdc_panel_s *panel)
{
  struct da1470x_lcdc_s *priv = &g_lcdc;
  uint32_t id;
  int ret;

  if (panel == NULL || panel->xres == 0 || panel->yres == 0 ||
      (panel->bpp != 16 && panel->bpp != 32 &&
       !(panel->bpp == 8 && panel->iface == DA1470X_LCDC_IF_JDI_PARALLEL)))
    {
      return -EINVAL;
    }

  if (priv->initialized)
    {
      return OK;
    }

  /* The LCDC lives in PD_GPU and is clocked from DIVN through CRG_SYS */

  ret = da1470x_pd_enable(DA1470X_PD_GPU);
  if (ret < 0)
    {
      return ret;
    }

  putreg32(CRG_SYS_CLK_SYS_LCD_RESET_REQ, DA1470X_CRG_SYS_RESET_CLK_SYS);
  putreg32(CRG_SYS_CLK_SYS_LCD_CLK_SEL, DA1470X_CRG_SYS_RESET_CLK_SYS);
  putreg32(CRG_SYS_CLK_SYS_LCD_ENABLE, DA1470X_CRG_SYS_SET_CLK_SYS);

  id = getreg32(DA1470X_LCDC_IDREG);
  if (id != DA1470X_LCDC_IDREG_MAGIC)
    {
      lcderr("LCDC ID mismatch: %08" PRIx32 "\n", id);
      return -ENODEV;
    }

  /* Frame buffers */

  priv->panel  = panel;
  priv->stride = panel->xres * (panel->bpp / 8);
  priv->buflen = (size_t)priv->stride * panel->yres;
  priv->fblen  = priv->buflen * LCDC_NBUFFERS;
  priv->fbmem  = kmm_memalign(32, priv->fblen);
  if (priv->fbmem == NULL)
    {
      return -ENOMEM;
    }

  memset(priv->fbmem, 0, priv->fblen);

  /* Controller configuration, then the panel start-up sequence */

  if (panel->iface == DA1470X_LCDC_IF_JDI_PARALLEL)
    {
      lcdc_jdi_configure(panel);
    }
  else
    {
      lcdc_qspi_configure(panel);
    }

  lcdc_set_timing(panel, panel->xres, panel->yres);
  lcdc_set_layer0(priv, priv->fbmem, panel->xres, panel->yres);

  putreg32(0, DA1470X_LCDC_INTERRUPT);
  irq_attach(DA1470X_IRQ_LCD, lcdc_interrupt, priv);
  up_enable_irq(DA1470X_IRQ_LCD);

  if (panel->power != NULL)
    {
      panel->power(panel, true);
    }

  if (panel->init != NULL)
    {
      ret = panel->init(panel);
      if (ret < 0)
        {
          lcderr("Panel init failed: %d\n", ret);
          kmm_free(priv->fbmem);
          priv->fbmem = NULL;
          return ret;
        }
    }

#ifdef CONFIG_DA1470X_LCDC_ASYNC
  ret = kthread_create("lcdc", LCDC_THREAD_PRIORITY, LCDC_THREAD_STACKSIZE,
                       lcdc_thread, NULL);
  if (ret < 0)
    {
      lcderr("Transfer thread failed: %d\n", ret);
      kmm_free(priv->fbmem);
      priv->fbmem = NULL;
      return ret;
    }
#endif

  priv->initialized = true;

  /* Push the cleared frame buffer so the panel does not show whatever
   * its own memory held at power-up.
   */

  ret = lcdc_send_region(priv, 0, 0, 0, panel->xres, panel->yres);
  if (ret < 0)
    {
      lcdwarn("Initial frame failed: %d\n", ret);
    }

  return OK;
}

/****************************************************************************
 * Name: up_fbinitialize
 *
 * Description:
 *   Initialize the framebuffer video hardware associated with the display.
 *   The controller is set up by da1470x_lcdc_register() from the board;
 *   here we only check that it happened.
 *
 ****************************************************************************/

int up_fbinitialize(int display)
{
  if (display != 0)
    {
      return -EINVAL;
    }

  return g_lcdc.initialized ? OK : -ENODEV;
}

/****************************************************************************
 * Name: up_fbgetvplane
 *
 * Description:
 *   Return a reference to the framebuffer object for the specified video
 *   plane of the specified plane.
 *
 ****************************************************************************/

struct fb_vtable_s *up_fbgetvplane(int display, int vplane)
{
  if (display != 0 || vplane != 0 || !g_lcdc.initialized)
    {
      return NULL;
    }

  return &g_lcdc.vtable;
}

/****************************************************************************
 * Name: up_fbuninitialize
 *
 * Description:
 *   Uninitialize the framebuffer support for the specified display.
 *
 ****************************************************************************/

void up_fbuninitialize(int display)
{
  struct da1470x_lcdc_s *priv = &g_lcdc;

  if (display != 0 || !priv->initialized)
    {
      return;
    }

  up_disable_irq(DA1470X_IRQ_LCD);
  irq_detach(DA1470X_IRQ_LCD);

  if (priv->panel->power != NULL)
    {
      priv->panel->power(priv->panel, false);
    }

  putreg32(0, DA1470X_LCDC_LAYER0_MODE);
  putreg32(0, DA1470X_LCDC_DBIB_CFG);
  putreg32(CRG_SYS_CLK_SYS_LCD_ENABLE, DA1470X_CRG_SYS_RESET_CLK_SYS);

  kmm_free(priv->fbmem);
  priv->fbmem       = NULL;
  priv->initialized = false;
}

#endif /* CONFIG_DA1470X_LCDC */
